package LearnCollections;

public class Theory {

    /**
     * TODO Что такое коллекция?
     *
     * JCF (Java Collection Framework) - набор классов и интерфейсов для работы с коллекциями.
     *  - динамически изменяет размер
     *  - удобная для работы с набором данных
     *  - существуют готовые коллекции для решения многих задач
     *
     * TODO Чем коллекция отличается от массива?
     *
     * - коллекция - набор данных определенного типа
     * - в основе коллекций лежат массивы
     *
     *             Collections                  Map
     *           /     |      \                  |
     *        Set     List    Queue         SortedMap
     *         |                |
     *     SortedSet          Deque
     *
     *  Set - неупорядоченный набор елементов (самый простой список)
     *  - не содержит дубликатов, каждый элемент уникальный
     *  - аналог множетва в математике
     *
     *  List - каждый объект имеет свой index
     *  - может сожержать дубликаты
     *
     */

}
